#-*- mode: org -*-
#+STARTUP: heads

#+TITLE=Specific LaTeX configures

** To get a full featured `LaTeX-section' command
=LaTeX-section= command runs the hook =LaTeX-section-hook=, which is a list of function which actually generate the header.
The last function =LaTeX-section-label= creates the label for the header.
It is a warparound of =LaTeX-label=, which calls (when it is fbounded) =LaTeX-label-function=, which is seted to =reftex-lable= by RefTeX package (I do not know which option config sets it).
So, when you call =LaTeX-section= in fact, it is =reftex-label= who generates the proposed/automatic label for this header.
So, I do not know how important the list =LaTeX-section-label is=, the really important list is =reftex-section-prefixes= (see RefTeX, Label list)
 
#+BEGIN_SRC elisp
  ;; Hook with the list of funtions to run to create a header.
  (setq LaTeX-section-hook '(;; LaTeX-section-heading  
                             LaTeX-section-title
                             ;; LaTeX-section-toc
                             LaTeX-section-section
                             LaTeX-section-label))

  ;; List of prefixes identifing each header.
  (setq LaTeX-section-label
        `,(brust-list-with-colon brust-LaTeX-headers))
#+END_SRC

#+RESULTS:
: ((part . (brust-add-colon brust-LaTeX-part-prefix)) (chapter . chp:) (section . sec:) (subsection . ssec:) (subsubsection . sssec:))

*** Section list
Defaults 
(("part" 0)
 ("chapter" 1)
 ("section" 2)
 ("subsection" 3)
 ("subsubsection" 4)
 ("paragraph" 5)
 ("subparagraph" 6))

#+BEGIN_SRC elisp
  (setq LaTeX-section-list ;; Levels used to insert new headers by LaTeX-section, which is used by cdlatex. 
        '(("part"          0)
          ("chapter"       1)
          ("section"       2)
          ("paragraph"     3)
          ("subsection"    4)
          ("subsubsection" 5)
          ("subparagraph"  6)))
#+END_SRC

#+RESULTS:
| part          | 0 |
| chapter       | 1 |
| section       | 2 |
| subsection    | 3 |
| paragraph     | 3 |
| subsubsection | 4 |
| subparagraph  | 6 |

*** Settings
#+BEGIN_SRC elisp
  (setq ;; reftex-allow-automatic-rescan t
        reftex-enable-partial-scans t
        reftex-save-parse-info t
        ;; reftex-use-multiple-selection-buffers t
        ;; reftex-ref-macro-prompt nil
        ;; reftex-toc-max-level 3
        reftex-auto-recenter-toc t
        ;; reftex-toc-auto-recenter-timer 1
        ;; reftex-toc-include-context t
        reftex-toc-confirm-promotion nil
        reftex-toc-follow-mode nil
        ;; reftex-cite-prompt-optional-args nil
        ;; reftex-cite-cleanup-optional-args t
        reftex-guess-label-type nil
        reftex-ref-style-default-list (quote ("Cleveref"))
        reftex-refstyle "\\cref" ;; binding the command for references. No styles and other shits. Much faster executatoin.
        ;; Problem with diagrams: make an environment form then, so cleveref will produce right names :)

        ;; So that RefTeX also recognizes \addbibresource. Note that you
        ;; can't use $HOME in path for \addbibresource but "~".
        ;; reftex-bibliography-commands '("bibliography" "nobibliography" "addbibresource")
        ;; reftex-refstyle "\\Cref" ;; set the defult refstyle...
        ;; reftex-ref-style-default-list (append (quote ("Cleveref")) reftex-ref-style-default-list)
        ;; reftex-cite-format
        ;;  '((?\C-m . "\\cite[]{%l}")
        ;;    (?f . "\\footcite[][]{%l}")
        ;;    (?t . "\\textcite[]{%l}")
        ;;    (?p . "\\parencite[]{%l}")
        ;;    (?o . "\\citepr[]{%l}")
        ;;    (?n . "\\nocite{%l}"))
        )
#+END_SRC

#+RESULTS:
: \cref

** Environment definitons
#+BEGIN_SRC elisp

  (defun brust-cdlatex-new-environment (env)
    (concat "\\begin{" (car env) "}\\label{" (cdr env) ":?}\n\n\\end{" (car env) "}"))

  (setq cdlatex-env-alist
        (append (cl-loop for xx in brust-LaTeX-environments collect
                         `(,(car xx)
                           ,(brust-cdlatex-new-environment xx)
                           nil))
                '(("diagram" "\\begin{equation}\\label[diagram]{dia:?}\n\\begin{tikzcd}\n ? \\\\\n  \\\\\n\\end{tikzcd}\n\\end{equation}" "&")
                  ("diagram*" "\\[\n\\begin{tikzcd}\n ? \\\\\n  \\\\\n\\end{tikzcd}\n\\]" "&")
                  ("proof"   "\\begin{proof}\n?\n\\end{proof}"                           nil)
                  ("frame"   "\\begin{frame}\n\\frametitle{?}\n\n\\end{frame}"           nil)
                  ("block"   "\\begin{block}{?}\n\n\\end{block}"                         nil)
                  ("array"   "\\begin{array}{?}\n  \\\\\n\\end{array}"                   "&")
                  ("tikz"    "\\[\n\\begin{tikzcd}\n ? \\\\\n  \\\\\n\\end{tikzcd}\n\\]" "&")
                  ("tikzbeamer" "\\begin{flushleft}\\begin{tikzcd}[ampersand replacement=\\&]\n ? \\\\\n  \\\\\n\\end{tikzcd}\\end{flushleft}\n\\]" "&")
                  ("tikzextended"
                   "\\[\n\\begin{tikzcd}[column sep=2em, row sep=.01ex]\%(Defaults)\n ? \\\\\n  \\\\\n\\end{tikzcd}\n\\]" "&"))
                cdlatex-env-alist)) ;;
  ;; cdlatex-environment uses 'assoc' which
  ;; "Return non-nil if KEY is equal to the car of an element of LIST.
  ;; The value is actually the first element of LIST whose car equals KEY."
  ;; Add cdlatex-env-alist at the end: so I have acces to their environments, but for duplicates mines are used.
#+END_SRC

#+RESULTS:
| array | \begin{array}{?} |

*** command-alist
    I delete the ones I do not want. In this way I keep the defaul list updated.
    Because the =setq=, the following =mapc= can not be done with a =cl-loop= 
#+BEGIN_SRC elisp
  (mapc (lambda (-key)
          (setq-default cdlatex-command-alist-default
                        (brust-list-delete-by-car -key cdlatex-command-alist-default)))
        '("pref"
          "ct"
          "cte"
          "cite{"
          "equ"
          "eqn"
          "alit"
          "alit*"
          "xal"
          "xal*"
          "xxa"
          "xxa*"
          "mul"
          "mul*"
          "gat"
          "gat*"
          "fla"
          "fla*"
          "fg"
          "sn"
          "ss"
          "sss"
          "ssp"
          "closed"
          "caseeq"
          "intl"
          "suml"
          "nonum"
          "qq"
          "qqq"))
#+END_SRC

#+RESULTS:
| pref | ct | cte | cite{ | equ | eqn | alit | alit* | xal | xal* | xxa | xxa* | mul | mul* | gat | gat* | fla | fla* | fg | sn | ss | sss | ssp | closed | caseeq | intl | suml | nonum | qq | qqq |

** Math symbol list =ñ=

#+BEGIN_SRC elisp
  (setq cdlatex-math-symbol-alist
        '(( ?c  ("\\circ"          "\\comp"    "\\cos"))
          ( ?a  ("\\alpha"         "\\aff"     ""))
          ( ?A  ("\\Alpha"         "\\aleph"))
          ( ?b  ("\\beta"))
          ( ?B  ("\\Beta"))
          ( ?C  ("\\lceil"         "\\rceil"     "\\arccos"))
          ( ?d  ("\\delta"         "\\partial"))
          ( ?D  ("\\Delta"         "\\nabla"))
          ( ?e  ("\\varepsilon"    "\\epsilon"   "\\exp"))
          ( ?E  ("\\exists"        ""            "\\ln"))
          ( ?f  ("\\varphi"        "\\field"     "\\phi"))
          ( ?F  ("\\Phi"                 ))
          ( ?g  ("\\gamma"         "\\dim~"       "\\deg~"))
          ( ?G  ("\\Gamma"))
          ( ?h  ("\\eta"           "\\hbar"))
          ( ?H  (""                 ))
          ( ?i  ("\\in"            "\\inte"       "i=1,\\dots,n"))
          ( ?I  ("\\Im"))
          ( ?j  ("\\iota"          "j=1,\\dots,n" "j=0,\\dots,n"))
          ( ?J  (""                 ))
          ( ?k  ("\\kappa"          ))
          ( ?K  (""                 ))
          ( ?l  ("\\lambda"        ""             "\\ln"))
          ( ?L  ("\\Lambda"         ))
          ( ?m  ("\\mu"            "\\module"  "\\matx"))
          ( ?M  (""                "\\matx" ))
          ( ?n  ("\\nu"            "\\nat"     "\\ln"))
          ( ?N  (""))
          ( ?o  ("\\omega"          ))
          ( ?O  ("\\Omega"         "\\mho"))
          ( ?p  ("\\pi"            "\\proj"    "\\perp"))
          ( ?P  ("\\Pi"))
          ( ?q  ("\\theta"         "\\qch"     "\\vartheta"))
          ( ?Q  ("\\Theta"         "\\rat"))
          ( ?r  ("\\rho"           "\\reals"   "\\varrho"))
          ( ?R  (""                "\\Re"))
          ( ?s  ("\\sigma"         "\\sch"     "\\set"))
          ( ?S  ("\\Sigma"         ""          "\\arcsin"))
          ( ?t  ("\\tau"           "\\set"     "\\tan"))
          ( ?T  (""                ""          "\\arctan"))
          ( ?u  ("\\upsilon"        ))
          ( ?U  ("\\Upsilon"        ))
          ( ?v  ("\\vee"            ))
          ( ?V  ("\\Phi"            ))
          ( ?w  ("\\xi"             ))
          ( ?W  ("\\Xi"             ))
          ( ?x  ("\\chi"   "x_1,\\dots,x_n" "x_0,\\dots,x_n"          ))
          ( ?X  (""                 ))
          ( ?y  ("\\psi"   "y_1,\\dots,y_m" "y_0,\\dots,y_m"          ))
          ( ?Y  ("\\Psi"            ))
          ( ?z  ("\\zeta"  "z_1,\\dots,z_k" "z_0,\\dots,z_k"        ))
          ( ?Z  ("" ))
          ;; ( ?  ( "" ))
          ( ?0  ("\\emptyset"       ))
          ( ?1  ("^{-1}"           "^{*}"   "^{#}"))
          ( ?2  ("\\clf"))
          ( ?3  ("\\cls"))
          ( ?4  ("\\clk"))
          ( ?5  ("\\clpi"))
          ( ?6  ("\\clb"))
          ( ?7  ("\\not"           "\\neq"))
          ( ?8  ("\\infty"          ))
          ( ?9  (""                 ))
          ( ?!  (""                 ))
          ( ?@  (""                 ))
          ( ?#  (""                 ))
          ( ?$  (""                 ))
          ( ?%  (""                 ))
          ( ?^  ("\\uparrow"        ))
          ( ?&  ("\\wedge"          ))
          ( ?\? (""                 ))
          ( ?_  ("\\overset"       "\\underto"))
          ( ?:  ("\\vdots"         "\\ddots"))
          ( ?,  ("\\from"          "\\bullet"  ""))
          ( ?.  ("\\dots"          "\\cdots"   "\\cdot"))
          ( ?-  ("\\to"            "\\tohook"  "\\tofunct"))
          ( ?*  ("\\otimes"        "\\cap"     "\\bigcap"))
          ( ?+  ("\\times"         "\\cup"     "\\bigcup"))
          ( ?/  ("\\not"           "\\neq"))
          ( ?|  ("\\perp"          ""))
          ( ?º  ("\\setminus"       ))
          ( ?\\ ("\\setminus"       ))
          ( ?\" (""                 ))
          ( ?~  ("\\approx"        "\\simeq"         "\\sim"))
          ( ?=  ("\\cong"          "\\equiv"))
          ( ?\( ("\\langle"         ))
          ( ?\) ("\\rangle"         ))
          ( ?\[ ("\\subseteq"     ""))
          ( ?\] ("\\supseteq"    ""))
          ( ?ç  ("\\subseteq"      "\\subset"))
          ( ?´  ("\\supseteq"      "\\supset"))
          ( ?{  ("\\{?\\}"))
          ( ?}  (""))
          ( ?<  ("\\le"            "\\min"))
          ( ?>  ("\\ge"            "\\max"))
          ( ?`  (""                 ))
          ( ?'  ("\\prime"          ))))
#+END_SRC

#+RESULTS:
|  99 | (\circ \comp \cos)                  |
|  97 | (\alpha \aff )                      |
|  65 | (\Alpha \aleph)                     |
|  98 | (\beta)                             |
|  66 | (\Beta)                             |
|  67 | (\lceil \rceil \arccos)             |
| 100 | (\delta \partial)                   |
|  68 | (\Delta \nabla)                     |
| 101 | (\varepsilon \epsilon \exp)         |
|  69 | (\exists  \ln)                      |
| 102 | (\varphi \field \phi)               |
|  70 | (\Phi)                              |
| 103 | (\gamma \dim~ \deg~)                |
|  71 | (\Gamma)                            |
| 104 | (\eta \hbar)                        |
|  72 | ()                                  |
| 105 | (\in \inte i=1,\dots,n)             |
|  73 | (\Im)                               |
| 106 | (\iota j=1,\dots,n j=0,\dots,n)     |
|  74 | ()                                  |
| 107 | (\kappa)                            |
|  75 | ()                                  |
| 108 | (\lambda  \ln)                      |
|  76 | (\Lambda)                           |
| 109 | (\mu \module \matx)                 |
|  77 | ( \matx)                            |
| 110 | (\nu \nat \ln)                      |
|  78 | ()                                  |
| 111 | (\omega)                            |
|  79 | (\Omega \mho)                       |
| 112 | (\pi \proj \perp)                   |
|  80 | (\Pi)                               |
| 113 | (\theta \qch \vartheta)             |
|  81 | (\Theta \rat)                       |
| 114 | (\rho \reals \varrho)               |
|  82 | ( \Re)                              |
| 115 | (\sigma \sch \set)                  |
|  83 | (\Sigma  \arcsin)                   |
| 116 | (\tau \set \tan)                    |
|  84 | (  \arctan)                         |
| 117 | (\upsilon)                          |
|  85 | (\Upsilon)                          |
| 118 | (\vee)                              |
|  86 | (\Phi)                              |
| 119 | (\xi)                               |
|  87 | (\Xi)                               |
| 120 | (\chi x_1,\dots,x_n x_0,\dots,x_n)  |
|  88 | ()                                  |
| 121 | (\psi y_1,\dots,y_m y_0,\dots,y_m)  |
|  89 | (\Psi)                              |
| 122 | (\zeta z_1,\dots,z_k z_0,\dots,z_k) |
|  90 | ()                                  |
|  48 | (\emptyset)                         |
|  49 | (^{-1} ^{*} ^{#})                   |
|  50 | (\clf)                              |
|  51 | (\cls)                              |
|  52 | (\clk)                              |
|  53 | (\clpi)                             |
|  54 | (\clb)                              |
|  55 | (\not \neq)                         |
|  56 | (\infty)                            |
|  57 | ()                                  |
|  33 | ()                                  |
|  64 | ()                                  |
|  35 | ()                                  |
|  36 | ()                                  |
|  37 | ()                                  |
|  94 | (\uparrow)                          |
|  38 | (\wedge)                            |
|  63 | ()                                  |
|  95 | (\overset \underto)                 |
|  58 | (\vdots \ddots)                     |
|  44 | (\from \bullet )                    |
|  46 | (\dots \cdots \cdot)                |
|  45 | (\to \tohook \tofunct)              |
|  42 | (\otimes \cap \bigcap)              |
|  43 | (\times \cup \bigcup)               |
|  47 | (\not \neq)                         |
| 124 | (\perp )                            |
| 186 | (\setminus)                         |
|  92 | (\setminus)                         |
|  34 | ()                                  |
| 126 | (\approx \simeq \sim)               |
|  61 | (\cong \equiv)                      |
|  40 | (\langle)                           |
|  41 | (\rangle)                           |
|  91 | ( )                                 |
|  93 | ( )                                 |
| 231 | (\subseteq \subset)                 |
| 180 | (\supseteq \supset)                 |
| 123 | (\{?\})                             |
| 125 | ()                                  |
|  60 | (\le \min)                          |
|  62 | (\ge \max)                          |
|  96 | ()                                  |
|  39 | (\prime)                            |

